; domain
(define (domain sobokosnake)
(:requirements :typing :negative-preconditions)
(:types location direction - object)
(:predicates
    ;up down left right of a field
    (MOVE-DIR ?x ?y - location ?dir - direction)
    ;snake that has not eaten anything yet
    (thinsnake ?x - location)
    ;the last field of the snake
    (tailsnake ?x - location)
    ;the first field of the snake
    (headsnake ?x - location)
    ;pieces of the snake that are connected. from front to back
    (nextsnake ?x ?y - location)
    ;a field that is occupied by the snake or by a hole
    (blocked ?x - location)
    ;a field that has a point that can be collected by the snake
    (ispoint ?x - location)
    ;a field that is occupied by an obstacle
    (isbox ?x - location)
    ;a field that has a hole on it
    (ishole ?x - location)
)

(:action move-thin-snake
    ;move thin snake
    :parameters (?oldposition ?newposition - location ?dir - direction)
    :precondition
    (and
        (thinsnake ?oldposition)
        (MOVE-DIR ?oldposition ?newposition ?dir)
        (not (blocked ?newposition))
        (not (ispoint ?newposition))
        (not (isbox ?newposition))
    )
    :effect
    (and
        (thinsnake ?newposition)
        (blocked ?newposition)
        (not (thinsnake ?oldposition))
        (not (blocked ?oldposition))
    )
)
(:action move-thin-snake-and-box
    ;move thin snake and push box
    :parameters (?oldposition ?newposition ?newboxposition - location ?dir - direction)
    :precondition
    (and
        (thinsnake ?oldposition)
        (MOVE-DIR ?oldposition ?newposition ?dir)
        (MOVE-DIR ?newposition ?newboxposition ?dir)
        (not (blocked ?newboxposition))
        (not (ispoint ?newposition))
        (isbox ?newposition)
        (not (isbox ?newboxposition))
        
    )
    :effect
    (and
        (thinsnake ?newposition)
        (blocked ?newposition)
        (not (thinsnake ?oldposition))
        (not (blocked ?oldposition))
        (not (isbox ?newposition))
        (isbox ?newboxposition)
    )
)
(:action move-thin-snake-and-box-to-hole
    ;move thin snake and push box to a hole
    :parameters (?oldposition ?newposition ?newboxposition - location ?dir - direction)
    :precondition
    (and
        (thinsnake ?oldposition)
        (MOVE-DIR ?oldposition ?newposition ?dir)
        (MOVE-DIR ?newposition ?newboxposition ?dir)
        (not (ispoint ?newposition))
        (isbox ?newposition)
        (ishole ?newboxposition)
        
    )
    :effect
    (and
        (thinsnake ?newposition)
        (blocked ?newposition)
        (not (thinsnake ?oldposition))
        (not (blocked ?oldposition))
        (not (isbox ?newposition))
        (not (ishole ?newboxposition))
        (not (blocked ?newboxposition))
    )
)



(:action move-thin-snake-and-first-eat
    ;move thin snake and eat
    :parameters (?position ?newhead - location ?dir - direction)
    :precondition
    (and
        (thinsnake ?position)
        (MOVE-DIR ?position ?newhead ?dir)
        (not (blocked ?newhead))
        (ispoint ?newhead)
        (not (isbox ?newhead))
    )
    :effect
    (and
        (blocked ?newhead)
        (headsnake ?newhead)
        (tailsnake ?position)
        (nextsnake ?newhead ?position)
        (not (ispoint ?newhead))
        (not (thinsnake ?position))
    )
)
(:action move-box-and-first-eat
    ;move thin snake, push box and eat
    :parameters (?position ?newhead ?newboxposition - location ?dir - direction)
    :precondition
    (and
        (thinsnake ?position)
        (MOVE-DIR ?position ?newhead ?dir)
        (MOVE-DIR ?newhead ?newboxposition ?dir)
        (not (blocked ?newboxposition))
        (ispoint ?newhead)
        (isbox ?newhead)
        (not (isbox ?newboxposition))
    )
    :effect
    (and
        (blocked ?newhead)
        (headsnake ?newhead)
        (tailsnake ?position)
        (nextsnake ?newhead ?position)
        (not (ispoint ?newhead))
        (not (thinsnake ?position))
        (not (isbox ?newhead))
        (isbox ?newboxposition)
    )
)
(:action move-box-to-hole-and-first-eat
    ;move thin snake, push box to a hole and eat
    :parameters (?position ?newhead ?newboxposition - location ?dir - direction)
    :precondition
    (and
        (thinsnake ?position)
        (MOVE-DIR ?position ?newhead ?dir)
        (MOVE-DIR ?newhead ?newboxposition ?dir)
        (ispoint ?newhead)
        (isbox ?newhead)
        (ishole ?newboxposition)
    )
    :effect
    (and
        (blocked ?newhead)
        (headsnake ?newhead)
        (tailsnake ?position)
        (nextsnake ?newhead ?position)
        (not (ispoint ?newhead))
        (not (thinsnake ?position))
        (not (isbox ?newhead))
        (not (ishole ?newboxposition))
        (not (blocked ?newboxposition))
    )
)
(:action move-fat-snake
    ;move snake
    :parameters (?head ?newhead ?tail ?newtail - location ?dir - direction)
    :precondition
    (and
        (not (thinsnake ?head))
        (headsnake ?head)
        (MOVE-DIR ?head ?newhead ?dir)
        (tailsnake ?tail)
        (nextsnake ?newtail ?tail)
        (not (blocked ?newhead))
        (not (ispoint ?newhead))
        (not (isbox ?newhead))
    )
    :effect
    (and
        (blocked ?newhead)
        (headsnake ?newhead)
        (nextsnake ?newhead ?head)
        (not (headsnake ?head))
        (not (blocked ?tail))
        (not (tailsnake ?tail))
        (not (nextsnake ?newtail ?tail))
        (tailsnake ?newtail)
    )
)
(:action move-fat-snake-and-box
    ;move snake and push box
    :parameters (?head ?newhead ?tail ?newtail ?newboxposition - location ?dir - direction)
    :precondition
    (and
        (not (thinsnake ?head))
        (headsnake ?head)
        (MOVE-DIR ?head ?newhead ?dir)
        (MOVE-DIR ?newhead ?newboxposition ?dir)
        (tailsnake ?tail)
        (nextsnake ?newtail ?tail)
        (not (blocked ?newboxposition))
        (not (ispoint ?newhead))
        (isbox ?newhead)
        (not (isbox ?newboxposition))
    )
    :effect
    (and
        (blocked ?newhead)
        (headsnake ?newhead)
        (nextsnake ?newhead ?head)
        (not (headsnake ?head))
        (not (blocked ?tail))
        (not (tailsnake ?tail))
        (not (nextsnake ?newtail ?tail))
        (tailsnake ?newtail)
        (not (isbox ?newhead))
        (isbox ?newboxposition)
    )
)
(:action move-fat-snake-and-box-to-hole
    ;move snake and push box to a hole
    :parameters (?head ?newhead ?tail ?newtail ?newboxposition - location ?dir - direction)
    :precondition
    (and
        (not (thinsnake ?head))
        (headsnake ?head)
        (MOVE-DIR ?head ?newhead ?dir)
        (MOVE-DIR ?newhead ?newboxposition ?dir)
        (tailsnake ?tail)
        (nextsnake ?newtail ?tail)
        (not (ispoint ?newhead))
        (isbox ?newhead)
        (ishole ?newboxposition)
    )
    :effect
    (and
        (blocked ?newhead)
        (headsnake ?newhead)
        (nextsnake ?newhead ?head)
        (not (headsnake ?head))
        (not (blocked ?tail))
        (not (tailsnake ?tail))
        (not (nextsnake ?newtail ?tail))
        (tailsnake ?newtail)
        (not (isbox ?newhead))
        (not (ishole ?newboxposition))
        (not (blocked ?newboxposition))
    )
)
(:action move-and-eat
    ;move snake and eat
    :parameters (?head ?newhead - location ?dir - direction)
    :precondition
    (and
        (not (thinsnake ?head))
        (headsnake ?head)
        (MOVE-DIR ?head ?newhead ?dir)
        (not (blocked ?newhead))
        (ispoint ?newhead)
        (not (isbox ?newhead))
    )
    :effect
    (and
        (blocked ?newhead)
        (headsnake ?newhead)
        (nextsnake ?newhead ?head)
        (not (headsnake ?head))
        (not (ispoint ?newhead))
    )
)
(:action move-box-and-eat
    ;move snake, push box and eat
    :parameters (?head ?newhead ?newboxposition - location ?dir - direction)
    :precondition
    (and
        (not (thinsnake ?head))
        (headsnake ?head)
        (MOVE-DIR ?head ?newhead ?dir)
        (MOVE-DIR ?newhead ?newboxposition ?dir)
        (not (blocked ?newboxposition))
        (ispoint ?newhead)
        (isbox ?newhead)
        (not (isbox ?newboxposition))
    )
    :effect
    (and
        (blocked ?newhead)
        (headsnake ?newhead)
        (nextsnake ?newhead ?head)
        (not (headsnake ?head))
        (not (ispoint ?newhead))
        (not (isbox ?newhead))
        (isbox ?newboxposition)
    )
)
(:action move-box-to-hole-and-eat
    ;move snake, push box to a hole and eat
    :parameters (?head ?newhead ?newboxposition - location ?dir - direction)
    :precondition
    (and
        (not (thinsnake ?head))
        (headsnake ?head)
        (MOVE-DIR ?head ?newhead ?dir)
        (MOVE-DIR ?newhead ?newboxposition ?dir)
        (ispoint ?newhead)
        (isbox ?newhead)
        (ishole ?newboxposition)
    )
    :effect
    (and
        (blocked ?newhead)
        (headsnake ?newhead)
        (nextsnake ?newhead ?head)
        (not (headsnake ?head))
        (not (ispoint ?newhead))
        (not (isbox ?newhead))
        (not (ishole ?newboxposition))
        (not (blocked ?newboxposition))
    )
)
)

; problem
(define (problem sobokosnake-2-2)
(:domain sobokosnake)
(:objects
    pos0-1 - location
    pos0-2 - location
    pos1-1 - location
    pos1-2 - location
    pos1-3 - location
    pos2-0 - location
    pos2-1 - location
    pos2-3 - location
    pos3-0 - location
    pos3-1 - location
    pos3-3 - location
    pos4-0 - location
    pos4-1 - location
    pos4-2 - location
    pos4-3 - location
    pos5-1 - location
    pos6-0 - location
    pos6-1 - location
    pos6-2 - location
    pos6-3 - location
    pos7-0 - location
    pos7-1 - location
    pos7-2 - location
    pos7-3 - location
    dir-right - direction
    dir-left - direction
    dir-up - direction
    dir-down - direction
)
(:init
    (MOVE-DIR pos0-1 pos0-2 dir-right)
    (MOVE-DIR pos0-1 pos1-1 dir-down)
    (MOVE-DIR pos0-2 pos1-2 dir-down)
    (MOVE-DIR pos0-2 pos0-1 dir-left)
    (MOVE-DIR pos1-1 pos1-2 dir-right)
    (MOVE-DIR pos1-1 pos2-1 dir-down)
    (MOVE-DIR pos1-1 pos0-1 dir-up)
    (MOVE-DIR pos1-2 pos1-1 dir-left)
    (MOVE-DIR pos1-2 pos1-3 dir-right)
    (MOVE-DIR pos1-2 pos0-2 dir-up)
    (MOVE-DIR pos1-3 pos1-2 dir-left)
    (MOVE-DIR pos1-3 pos2-3 dir-down)
    (MOVE-DIR pos2-0 pos2-1 dir-right)
    (MOVE-DIR pos2-0 pos3-0 dir-down)
    (MOVE-DIR pos2-1 pos2-0 dir-left)
    (MOVE-DIR pos2-1 pos3-1 dir-down)
    (MOVE-DIR pos2-1 pos1-1 dir-up)
    (MOVE-DIR pos2-3 pos3-3 dir-down)
    (MOVE-DIR pos2-3 pos1-3 dir-up)
    (MOVE-DIR pos3-0 pos2-0 dir-up)
    (MOVE-DIR pos3-0 pos3-1 dir-right)
    (MOVE-DIR pos3-0 pos4-0 dir-down)
    (MOVE-DIR pos3-1 pos3-0 dir-left)
    (MOVE-DIR pos3-1 pos4-1 dir-down)
    (MOVE-DIR pos3-1 pos2-1 dir-up)
    (MOVE-DIR pos3-3 pos4-3 dir-down)
    (MOVE-DIR pos3-3 pos2-3 dir-up)
    (MOVE-DIR pos4-0 pos3-0 dir-up)
    (MOVE-DIR pos4-0 pos4-1 dir-right)
    (MOVE-DIR pos4-1 pos4-0 dir-left)
    (MOVE-DIR pos4-1 pos4-2 dir-right)
    (MOVE-DIR pos4-1 pos5-1 dir-down)
    (MOVE-DIR pos4-1 pos3-1 dir-up)
    (MOVE-DIR pos4-2 pos4-1 dir-left)
    (MOVE-DIR pos4-2 pos4-3 dir-right)
    (MOVE-DIR pos4-3 pos4-2 dir-left)
    (MOVE-DIR pos4-3 pos3-3 dir-up)
    (MOVE-DIR pos5-1 pos6-1 dir-down)
    (MOVE-DIR pos5-1 pos4-1 dir-up)
    (MOVE-DIR pos6-0 pos6-1 dir-right)
    (MOVE-DIR pos6-0 pos7-0 dir-down)
    (MOVE-DIR pos6-1 pos6-0 dir-left)
    (MOVE-DIR pos6-1 pos6-2 dir-right)
    (MOVE-DIR pos6-1 pos7-1 dir-down)
    (MOVE-DIR pos6-1 pos5-1 dir-up)
    (MOVE-DIR pos6-2 pos6-1 dir-left)
    (MOVE-DIR pos6-2 pos6-3 dir-right)
    (MOVE-DIR pos6-2 pos7-2 dir-down)
    (MOVE-DIR pos6-3 pos6-2 dir-left)
    (MOVE-DIR pos6-3 pos7-3 dir-down)
    (MOVE-DIR pos7-0 pos6-0 dir-up)
    (MOVE-DIR pos7-0 pos7-1 dir-right)
    (MOVE-DIR pos7-1 pos7-0 dir-left)
    (MOVE-DIR pos7-1 pos7-2 dir-right)
    (MOVE-DIR pos7-1 pos6-1 dir-up)
    (MOVE-DIR pos7-2 pos7-1 dir-left)
    (MOVE-DIR pos7-2 pos7-3 dir-right)
    (MOVE-DIR pos7-2 pos6-2 dir-up)
    (MOVE-DIR pos7-3 pos7-2 dir-left)
    (MOVE-DIR pos7-3 pos6-3 dir-up)
    (thinsnake pos6-1)
    (blocked pos6-1)
    (ispoint pos0-1)
    (ispoint pos2-0)
    (ispoint pos2-3)
    (ispoint pos3-0)
    (ispoint pos3-1)
    (ispoint pos3-3)
    (ispoint pos4-0)
    (ispoint pos4-1)
    (ispoint pos4-3)
    (ispoint pos6-0)
    (ispoint pos6-3)
    (ispoint pos7-1)
    (ispoint pos7-2)
    (isbox pos5-1)
)
(:goal
(and
    (not (ispoint pos0-1))
    (not (ispoint pos2-0))
    (not (ispoint pos2-3))
    (not (ispoint pos3-0))
    (not (ispoint pos3-1))
    (not (ispoint pos3-3))
    (not (ispoint pos4-0))
    (not (ispoint pos4-1))
    (not (ispoint pos4-3))
    (not (ispoint pos6-0))
    (not (ispoint pos6-3))
    (not (ispoint pos7-1))
    (not (ispoint pos7-2))
)
)
)

; plan
1. (move-thin-snake-and-first-eat pos6-1 pos6-0 dir-left)
   deleted: (ispoint pos6-0) (thinsnake pos6-1)
   added: (blocked pos6-0) (headsnake pos6-0) (tailsnake pos6-1) (nextsnake pos6-0 pos6-1)
   goals met: 1 of 13
2. (move-fat-snake pos6-0 pos7-0 pos6-1 pos6-0 dir-down)
   deleted: (headsnake pos6-0) (blocked pos6-1) (tailsnake pos6-1) (nextsnake pos6-0 pos6-1)
   added: (blocked pos7-0) (headsnake pos7-0) (nextsnake pos7-0 pos6-0) (tailsnake pos6-0)
   goals met: 1 of 13
3. (move-and-eat pos7-0 pos7-1 dir-right)
   deleted: (headsnake pos7-0) (ispoint pos7-1)
   added: (blocked pos7-1) (headsnake pos7-1) (nextsnake pos7-1 pos7-0)
   goals met: 2 of 13
4. (move-and-eat pos7-1 pos7-2 dir-right)
   deleted: (headsnake pos7-1) (ispoint pos7-2)
   added: (blocked pos7-2) (headsnake pos7-2) (nextsnake pos7-2 pos7-1)
   goals met: 3 of 13
5. (move-fat-snake pos7-2 pos7-3 pos6-0 pos7-0 dir-right)
   deleted: (headsnake pos7-2) (blocked pos6-0) (tailsnake pos6-0) (nextsnake pos7-0 pos6-0)
   added: (blocked pos7-3) (headsnake pos7-3) (nextsnake pos7-3 pos7-2) (tailsnake pos7-0)
   goals met: 3 of 13
6. (move-and-eat pos7-3 pos6-3 dir-up)
   deleted: (headsnake pos7-3) (ispoint pos6-3)
   added: (blocked pos6-3) (headsnake pos6-3) (nextsnake pos6-3 pos7-3)
   goals met: 4 of 13
7. (move-fat-snake pos6-3 pos6-2 pos7-0 pos7-1 dir-left)
   deleted: (headsnake pos6-3) (blocked pos7-0) (tailsnake pos7-0) (nextsnake pos7-1 pos7-0)
   added: (blocked pos6-2) (headsnake pos6-2) (nextsnake pos6-2 pos6-3) (tailsnake pos7-1)
   goals met: 4 of 13
8. (move-fat-snake pos6-2 pos6-1 pos7-1 pos7-2 dir-left)
   deleted: (headsnake pos6-2) (blocked pos7-1) (tailsnake pos7-1) (nextsnake pos7-2 pos7-1)
   added: (blocked pos6-1) (headsnake pos6-1) (nextsnake pos6-1 pos6-2) (tailsnake pos7-2)
   goals met: 4 of 13
9. (move-fat-snake-and-box pos6-1 pos5-1 pos7-2 pos7-3 pos4-1 dir-up)
   deleted: (headsnake pos6-1) (blocked pos7-2) (tailsnake pos7-2) (nextsnake pos7-3 pos7-2) (isbox pos5-1)
   added: (blocked pos5-1) (headsnake pos5-1) (nextsnake pos5-1 pos6-1) (tailsnake pos7-3) (isbox pos4-1)
   goals met: 4 of 13
10. (move-box-and-eat pos5-1 pos4-1 pos3-1 dir-up)
   deleted: (headsnake pos5-1) (ispoint pos4-1) (isbox pos4-1)
   added: (blocked pos4-1) (headsnake pos4-1) (nextsnake pos4-1 pos5-1) (isbox pos3-1)
   goals met: 5 of 13
11. (move-fat-snake pos4-1 pos4-2 pos7-3 pos6-3 dir-right)
   deleted: (headsnake pos4-1) (blocked pos7-3) (tailsnake pos7-3) (nextsnake pos6-3 pos7-3)
   added: (blocked pos4-2) (headsnake pos4-2) (nextsnake pos4-2 pos4-1) (tailsnake pos6-3)
   goals met: 5 of 13
12. (move-and-eat pos4-2 pos4-3 dir-right)
   deleted: (headsnake pos4-2) (ispoint pos4-3)
   added: (blocked pos4-3) (headsnake pos4-3) (nextsnake pos4-3 pos4-2)
   goals met: 6 of 13
13. (move-and-eat pos4-3 pos3-3 dir-up)
   deleted: (headsnake pos4-3) (ispoint pos3-3)
   added: (blocked pos3-3) (headsnake pos3-3) (nextsnake pos3-3 pos4-3)
   goals met: 7 of 13
14. (move-and-eat pos3-3 pos2-3 dir-up)
   deleted: (headsnake pos3-3) (ispoint pos2-3)
   added: (blocked pos2-3) (headsnake pos2-3) (nextsnake pos2-3 pos3-3)
   goals met: 8 of 13
15. (move-fat-snake pos2-3 pos1-3 pos6-3 pos6-2 dir-up)
   deleted: (headsnake pos2-3) (blocked pos6-3) (tailsnake pos6-3) (nextsnake pos6-2 pos6-3)
   added: (blocked pos1-3) (headsnake pos1-3) (nextsnake pos1-3 pos2-3) (tailsnake pos6-2)
   goals met: 8 of 13
16. (move-fat-snake pos1-3 pos1-2 pos6-2 pos6-1 dir-left)
   deleted: (headsnake pos1-3) (blocked pos6-2) (tailsnake pos6-2) (nextsnake pos6-1 pos6-2)
   added: (blocked pos1-2) (headsnake pos1-2) (nextsnake pos1-2 pos1-3) (tailsnake pos6-1)
   goals met: 8 of 13
17. (move-fat-snake pos1-2 pos0-2 pos6-1 pos5-1 dir-up)
   deleted: (headsnake pos1-2) (blocked pos6-1) (tailsnake pos6-1) (nextsnake pos5-1 pos6-1)
   added: (blocked pos0-2) (headsnake pos0-2) (nextsnake pos0-2 pos1-2) (tailsnake pos5-1)
   goals met: 8 of 13
18. (move-and-eat pos0-2 pos0-1 dir-left)
   deleted: (headsnake pos0-2) (ispoint pos0-1)
   added: (blocked pos0-1) (headsnake pos0-1) (nextsnake pos0-1 pos0-2)
   goals met: 9 of 13
19. (move-fat-snake pos0-1 pos1-1 pos5-1 pos4-1 dir-down)
   deleted: (headsnake pos0-1) (blocked pos5-1) (tailsnake pos5-1) (nextsnake pos4-1 pos5-1)
   added: (blocked pos1-1) (headsnake pos1-1) (nextsnake pos1-1 pos0-1) (tailsnake pos4-1)
   goals met: 9 of 13
20. (move-fat-snake pos1-1 pos2-1 pos4-1 pos4-2 dir-down)
   deleted: (headsnake pos1-1) (blocked pos4-1) (tailsnake pos4-1) (nextsnake pos4-2 pos4-1)
   added: (blocked pos2-1) (headsnake pos2-1) (nextsnake pos2-1 pos1-1) (tailsnake pos4-2)
   goals met: 9 of 13
21. (move-box-and-eat pos2-1 pos3-1 pos4-1 dir-down)
   deleted: (headsnake pos2-1) (ispoint pos3-1) (isbox pos3-1)
   added: (blocked pos3-1) (headsnake pos3-1) (nextsnake pos3-1 pos2-1) (isbox pos4-1)
   goals met: 10 of 13
22. (move-fat-snake-and-box pos3-1 pos4-1 pos4-2 pos4-3 pos5-1 dir-down)
   deleted: (headsnake pos3-1) (blocked pos4-2) (tailsnake pos4-2) (nextsnake pos4-3 pos4-2) (isbox pos4-1)
   added: (blocked pos4-1) (headsnake pos4-1) (nextsnake pos4-1 pos3-1) (tailsnake pos4-3) (isbox pos5-1)
   goals met: 10 of 13
23. (move-and-eat pos4-1 pos4-0 dir-left)
   deleted: (headsnake pos4-1) (ispoint pos4-0)
   added: (blocked pos4-0) (headsnake pos4-0) (nextsnake pos4-0 pos4-1)
   goals met: 11 of 13
24. (move-and-eat pos4-0 pos3-0 dir-up)
   deleted: (headsnake pos4-0) (ispoint pos3-0)
   added: (blocked pos3-0) (headsnake pos3-0) (nextsnake pos3-0 pos4-0)
   goals met: 12 of 13
25. (move-and-eat pos3-0 pos2-0 dir-up)
   deleted: (headsnake pos3-0) (ispoint pos2-0)
   added: (blocked pos2-0) (headsnake pos2-0) (nextsnake pos2-0 pos3-0)
   goals met: 13 of 13
